from utils.general.general_functions import calculate_product_indicators
# РОЗРАХУНОК ПОКАЗНИКІВ ПІД ЧАС СТВОРЕННЯ ДЕПОЗИТУ
def calculate_deposit_values(instance, days):

    # Якщо поле таблиці auto_capitalization == 'not apply' тобто '0' - стандартний розрахунок
    if instance.auto_capitalization == 0:

        list_of_indicators= calculate_product_indicators(instance, days)

        return list_of_indicators # поверне список індикаторів [dayily_profit, month_profit, year_profit, total_profit]

    # Якщо поле таблиці auto_capitalization застосоване - розрахунок доходу депозиту згідно обраної частоти капіталізації
    else:
        total_profit = (instance.sum * (1 + (instance.rate / 100) / instance.auto_capitalization) **
                        (instance.auto_capitalization * (instance.period/12))) - instance.sum
        month_profit = total_profit / instance.period
        dayily_profit = total_profit / (days * instance.period / 12)

        # Якщо депозит менший або дорвнює 12 міс. його загальний дохід рахується як річний
        if instance.period <= 12:
            year_profit = total_profit
        # Якщо депозит більший за 12 міс. , рахуємо дохід тільки за 12 міс.
        else:
            year_profit = (instance.sum * (1 + (instance.rate / 100) / instance.auto_capitalization) **
                        instance.auto_capitalization) - instance.sum

        return [dayily_profit, month_profit, year_profit, total_profit]


# Ф-Я ПОШУКУ МІСЯЦІВ ПРИ РОЗІРВАННІ ДЕПОЗИТУ
# ПРИЙМАЄМО НА ВХІД ОБЄКТ(ДЕПОЗИТ) ТА ДАТУ РОЗІРВАННЯ ДОГОВОРУ
def defining_month(instance,terminate_date):

    # Вираховуємо різницю в днях (початкова дата - дата розірвання)
    # Таке рівняння можливе за допомогою модуля datetime
    difference = terminate_date - instance.start_date
    # За допомогою методу .days отримуємо дні
    number_of_days = difference.days
    # Повертаємо заокруглені місяці (...< 1.5 = 1 , 1.5 < ... = 2)
    return round(number_of_days/30)



# Формула розрахунку складних %
# Для розрахунку складних відсотків існує спеціальна формула:
# FV = PV × (1 + r/n)^(n×t)
# де:
# FV - майбутня (майже завжди більша) вартість вкладу, який враховує складні відсотки.
# PV - початкова вартість вкладу.
# r - річна процентна ставка.
# n - число разів, коли відсотки нараховуються за рік.
# t - кількість років, на які вклад буде розміщено.
# Отже, для розрахунку складних відсотків потрібно враховувати частоту нарахування відсотків за рік (n). Якщо відсотки нараховуються щорічно, то n = 1, якщо півріччями, то n = 2, кварталами - n = 4, місячні відсотки - n = 12 і т.д.
# Наприклад, якщо ви розмістите вклад на 1000 доларів під 5% річних зі складними відсотками, які нараховуються щомісяця, на 2 роки, то майбутня вартість вкладу буде:
# FV = 1000 × (1 + 0.05/12)^(12×2) = 1104.08 доларів.
# Отже, після 2 років вартість вашого вкладу збільшиться до 1104.08 доларів з початкових 1000 доларів, якщо ви зможете зберігати гроші на вкладі протягом усього терміну депозиту і банк не змінить умови вкладу.

# Формула розрахунку стандартних %
# Визначення місячного доходу по депозитам :
#  - Записуємо в масив місячний дохід по кожному депозиту і потім сумуємо значення
#  - Формула : місячний дохід = сума депозиту * ставка % * період (12міс.-1, 6міс.-0,5, 3 міс. - 0,25) - тут ми
#    дізнаємось загальний дохід від депозиту , далі ділимо на період 12,6,3міс.
#  - Приклад : 100 000 грн * 18% * 1 = 18 0000 грн / 12міс. = 1 500 грн в міс.
# Визначення загального доходу по депозитам :
# Формула : Основна сума * Ставка * Період часу/12
# Капіталізація % :
# Депозит 1 000 грн , 22% річних , 12 міс.
# 1. Беремо депозит і проганяємо в циклі відповідно до терміну (к-сть місяців)
# 2. Вираховуємо % за кожен місяць і додаємо їх до тіла депозиту кожен раз при ітерації циклу
# 3. Загальний дохід = Проітерований депозит з % - початкову суму депозиту.